{
  "jobs": [
    {
      "title": "Full Stack Developer",
      "company": "Sanvi Business Solutions",
      "location": "Chennai",
      "payscale": "₹25K/month - ₹40K/month",
      "date": "June 2022",
      "description": "As a Full Stack Developer, you'll be responsible for developing and maintaining web applications using Angular, PHP, MSSQL, MySQL, as well as HTML, CSS, and JavaScript. You’ll engage in both front-end and back-end development, ensuring a seamless user experience and efficient performance.",

      "contact": "9176033506/9791033506",
      "link": "https://www.linkedin.com/company/sanvi-business-solutions/jobs/",
      "status": "Applied"
    },
    {
      "title": "Senior Node.js Developer",
      "company": "DevelopScripts LLC",
      "location": "Chennai, Tamil Nadu",
      "date": "July 2021",
      "payscale": "Negotiable",
      "link": "https://www.linkedin.com/jobs/view/4035822159/?alternateChannel=search&refId=ANByB%2BNRHO81jbYcFUbP8A%3D%3D&trackingId=cgaZXSbxWu41lwiu0bKVNA%3D%3D&trk=d_flagship3_search_srp_jobs",
      "description": "Developing and maintaining all server-side network components including mysql and express.js Ensuring optimal performance of the central database and responsiveness to front-end requests.Collaborating with front-end developers on the integration of elements in Next.js and React.jsDesigning customer-facing React.js and Next.js and back-end services for various business processes.Developing high-performance applications by writing testable, reusable, and efficient code.Implementing effective security protocols, data protection measures, and storage solutions.Running diagnostic tests, repairing defects, and providing technical support.Documenting Node.js processes, including database schemas, as well as preparing reports.Recommending and implementing improvements to processes and technologies.",
      "status": "Applied"
    },
    {
      "title": "React Js Developer",
      "company": "Trimble Inc.",
      "location": "Chennai, Tamil Nadu",
      "date": "26 Sep 2024",
      "payscale": "Negotiable",
      "link": "https://www.linkedin.com/jobs/view/4034339921",
      "description": "Onsite / Hybrid",
      "status": "Applied"
    },
    {
      "title": "Full Stack Developer",
      "company": "KIRSHI TECHNOLOGIES AND CONSULTING PRIVATE LIMITED.",
      "location": "Chennai & Madurai, Tamil Nadu",
      "date": "26 Sep 2024",
      "payscale": "Negotiable",
      "link": "https://www.linkedin.com/jobs/view/4034607527",
      "description": "Onsite / Hybrid",
      "status": "Applied"
    },
    {
      "title": "React Developer",
      "company": "Datasys Consulting and Software Inc.",
      "location": "Chennai & Madurai, Tamil Nadu",
      "date": "26 Sep 2024",
      "payscale": "Negotiable",
      "link": "https://www.linkedin.com/jobs/view/4034506346",
      "description": "Onsite / Hybrid",
      "status": "Applied"
    },
    {
      "title": "Senior Frontend Engineer (FullStack)",
      "company": "Digital Video Industry",
      "location": "Bengaluru (Bangalore)",
      "date": "26 Sep 2024",
      "payscale": "Negotiable",
      "link": "https://cutshort.io/job/Senior-Frontend-Engineer-FullStack-Bengaluru-Bangalore-HyrHub-LUfh6HOa",
      "description": "1 - 5 years of SW development experience Experience in React JS &amp; Ext JS Strong skills in Database Design(PostgreSQL or MySQL) Experience in developing Web applications &amp; REST APIs Experience in working with JSP/Servlets, Struts, Spring / Spring Boot, Hibernate Experience in working with web technologies HTML,CSS Strong focus on high-quality and maintainable code Understanding of multithreading, memory management, object-oriented programming",
      "status": "Applied"
    },
    {
      "title": "React Developer ",
      "company": "ValGenesis",
      "location": "Chennai",
      "date": "26 Sep 2024",
      "payscale": "Negotiable",
      "link": "https://www.linkedin.com/jobs/view/4032995921",
      "description": "3+ years of experience in front-end development with a focus on React.js Proficient in HTML, CSS, and JavaScript Experience with Redux or similar state management libraries Familiarity with RESTful APIs and asynchronous request handling Strong understanding of web performance and optimization techniques Experience with version control systems, preferably Git Excellent problem-solving skills and a collaborative attitude Ability to work in a fast-paced environment and meet deadlines Strong communication skills, both verbal and written ",
      "status": "Applied"
    },
    {
      "title": "Backend Developer ",
      "company": "PineGap.ai",
      "location": "Bengaluru (Bangalore)",
      "date": "03 Oct 2024",
      "payscale": "Negotiable",
      "link": "https://www.linkedin.com/jobs/view/4037956744",
      "description": "About the job Requirements:_ Work from office (Bengaluru) Assist in developing full-stack applications using Next.js and TypeScript on the frontend, and Express.js, Python (FastAPI), and TypeScript on the backend. Work with PostgreSQL and DynamoDB to design and optimize databases, ensuring data integrity and efficient querying. Collaborate with the team to deploy and manage applications on AWS, including configuring services like EC2, S3, and Lambda. Implement RESTful APIs and integrate them with frontend components, ensuring seamless user experiences and efficient data flows. Participate in code reviews and debugging to ensure the delivery of high-quality and scalable solutions.",
      "status": "Applied"
    },
    {
      "title": "Lead Fullstack Engineer",
      "company": "Foodhub",
      "location": "Chennai, Tamil Nadu, India",
      "date": "26 Sep 2024",
      "payscale": "Negotiable",
      "link": "https://www.linkedin.com/jobs/view/4025112853",
      "description": "Role and Responsibilities: Hands-On Technical Leadership: Actively engage in hands-on development while leading back-end engineering efforts. Serve as a key contributor in coding, debugging, and optimizing code. Advanced System Development: Design and implement complex back-end systems such as job managers, schedulers, and other critical infrastructure components, ensuring robustness and scalability. Project Ownership and Execution: Oversee project timelines and deliverables, demonstrating strong project management skills along with technical expertise. High-Quality Code Development: Develop well-designed, testable, and efficient code, setting the standard for code quality and engineering excellence within the team. Performance Optimization: Build high-volume, low-latency systems for mission-critical applications, optimizing for performance and reliability. Team Collaboration and Mentorship: Lead and mentor a team of back-end developers, fostering a culture of technical excellence, continuous learning, and collaborative problem-solving. Strategic Technical Decisions: Make informed decisions on back-end architecture, technology stack, and tooling, aligning with the overall product strategy and company goals. Preferred candidate profile Experience: Minimum of 8 years in software/product development, with substantial hands-on experience in back-end development Core Back end Technologies: Expertise in languages and frameworks such as Java-script, Typescript, NodeJS, ExpressJS. Complex System Development: Proven track record of developing and managing complex backend modules like job managers, schedulers, and other distributed systems components. Experience in Using GraphQL, including schema design and optimization. API Development: Deep experience in building scalable, low latency RESTful APIs. Monitoring & Observability: Experience in tools like Cloud Watch, New Relic, ELK, Grafana Knowledge in integrating identity servers, Authentication with OAUTH or JWT. Database Expertise: Strong knowledge of relational and NoSQL databases, including MySQL, DynamoDB with skills in design and optimization. Solid Computer Science Fundamentals: Mastery in data structures, algorithms, and OOP concepts. Cloud and DevOps Proficiency: Extensive experience with AWS services like AWS Lambda (Serverless), API Gateway, IAM, CDK, DynamoDB. Experience with message brokers (Apache Kafka, RabbitMQ, and AWS SNS/SQS), task queues (Celery), and an understanding of frontend technologies is advantageous. Communication Skills: Excellent communication abilities, effective in team collaboration and in explaining complex technical concepts to non-technical stakeholders.",
      "status": "Applied"
    },

    {
      "title": "Lead Engineer, Software ",
      "company": "Foodhub",
      "location": "Guindy, Tamil Nadu, India ",
      "date": "26 Sep 2024",
      "payscale": "Negotiable",
      "link": "https://www.linkedin.com/jobs/view/4013817603",
      "skills": "Strong programming skills: Proficiency in full stack development. Knowledge of Python, Web application frameworks: Knowledge of web application frameworks like React.JS, Node.JS  Database system knowledge: Experience with SQL database like Postgres SQL and NoSQL databases like MongoDB Debugging and testing skills: Ability to identify and resolve software issues. Problem-solving skills: Strong analytical and problem-solving abilities Experience with data center deployments: Prior experience in data center architectures, developing and maintaining software for deployments is a plus",
      "responsibility": "",
      "description": "Celestica is looking for a talented and passionate software engineers who can help drive next generation data center and AI compute blades to join our team. You'll be responsible for designing, developing, and testing software that will deploy and manage all components of a data center.Detailed Description",
      "status": "Applied"
    },
    {
      "title": "Tech Lead Full Stack (Java + React)",
      "company": "Nextiva",
      "location": "Chennai, Tamil Nadu, India ·",
      "date": "26 Sep 2024",
      "payscale": "Negotiable",
      "link": "https://www.linkedin.com/jobs/view/3999392896",
      "skills": "Proven experience as a Software Engineer with a minimum of 8+ years of experience  Strong expertise in Java, React JS, Node.js , Kafka and Spring/Springboot.  In-depth knowledge of modern software development methodologies (Agile, DevOps)  Experience building and leading high-performing engineering teams  Expertise in building RESTful web applications using Java 8+ and Spring Framework  Familiarity with Maven, Docker, Kubernetes, and cloud platforms is a plus  Experience with distributed systems, databases (MySQL, Postgres), and caching solutions (Redis) is a plus  Strong understanding of system design principles, security best practices, and testing methodologies",
      "responsibility": "Lead and mentor: Guide and empower your team members to achieve their full potential. Foster a collaborative and supportive environment where individuals can learn, grow, and thrive. Technical Visionary: Define the technical vision and roadmap, staying ahead of the curve on emerging technologies and best practices. Architect and Design: Lead the design and architecture of complex software systems, ensuring scalability, maintainability, and security. Delivery Excellence: Champion a culture of continuous improvement, driving efficient development processes and high-quality code delivery. Hands-on Problem Solving: Tackle intricate technical challenges and provide effective solutions. Communication & Collaboration: Lead by example with clear and concise communication. Collaborate effectively with stakeholders across various teams.",
      "description": "At Simplify360, it's more than just work. Redefine the future of customer experiences. One conversation at a time. Simplify360 is now a Nextiva company. Together, Nextiva and Simplify360 are changing the game with a first-of-its-kind, conversation-centric platform that unifies team collaboration and customer experience in one place. Powered by AI, built by amazing humans.  Our culture is forward-thinking, customer-obsessed and built on an unwavering belief that connection fuels business and life.  If you’re ready to collaborate and create with amazing people, let your personality shine and be on the frontlines of helping businesses deliver amazing experiences, you’re in the right place.  Build Amazing - Deliver Amazing - Live Amazing - Be Amazing  We are seeking a Tech Lead Developer to drive the evolution of the Simplify360 suite and contribute to Nextiva's mission of enhancing customer engagement. We're building a world class design team, dedicated to envisioning, creating, and building the next generation of business communication experiences.",
      "status": "Applied"
    }
  ]
}
